tests/load/srs-flashcards.load.yml
config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3000' }}"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN || 'test-token' }}"
  processor: "./helpers/srs-helpers.js"
  variables:
    word_tokens:
      - "bonjour"
      - "hola"
      - "ciao"
      - "guten_tag"
      - "konnichiwa"
      - "annyeonghaseyo"
      - "nihao"
      - "namaste"
      - "salaam"
      - "ola"
      - "merhaba"
      - "hei"
      - "szia"
      - "tere"
      - "hej"
      - "hallo"
      - "salut"
      - "privet"
      - "yassou"
      - "shalom"
    quality_scores:
      - 0
      - 1
      - 2
      - 3
      - 4
      - 5
    srs_levels:
      - 0
      - 1
      - 2
      - 3
      - 4

scenarios:
  - name: "Create flashcard"
    weight: 25
    flow:
      - post:
          url: "/flashcards"
          json:
            word_token: "{{ $randomChoice('bonjour', 'hola', 'ciao', 'guten_tag', 'konnichiwa', 'annyeonghaseyo', 'nihao', 'namaste', 'salaam', 'ola', 'merhaba', 'hei', 'szia', 'tere', 'hej', 'hallo', 'salut', 'privet', 'yassou', 'shalom') }}"
            translation: "{{ $randomChoice('hello', 'good day', 'greetings', 'hi', 'hey', 'good morning') }}"
            original_context: "Load test generated flashcard at {{ $now }}"
            definition: "A common greeting in various languages"
            pronunciation_url: "https://audio.example.com/pronunciation.mp3"
          capture:
            - json: "$.id"
              as: "flashcard_id"
          expect:
            - statusCode: 201

  - name: "Review flashcard with good recall"
    weight: 20
    flow:
      - post:
          url: "/flashcards"
          json:
            word_token: "revision_{{ $randomChoice('alpha', 'beta', 'gamma', 'delta', 'epsilon') }}"
            translation: "{{ $randomChoice('hello', 'good day', 'greetings', 'hi', 'hey') }}"
          capture:
            - json: "$.id"
              as: "flashcard_id"
      - patch:
          url: "/flashcards/{{ flashcard_id }}/srs"
          json:
            quality: "{{ $randomChoice(4, 5) }}"
          expect:
            - statusCode: 200

  - name: "Review flashcard with poor recall"
    weight: 10
    flow:
      - post:
          url: "/flashcards"
          json:
            word_token: "poor_recall_{{ $randomChoice('theta', 'zeta', 'iota', 'kappa', 'lambda') }}"
            translation: "{{ $randomChoice('hello', 'good day', 'greetings', 'hi', 'hey') }}"
          capture:
            - json: "$.id"
              as: "flashcard_id"
      - patch:
          url: "/flashcards/{{ flashcard_id }}/srs"
          json:
            quality: "{{ $randomChoice(0, 1, 2) }}"
          expect:
            - statusCode: 200

  - name: "Get all flashcards"
    weight: 15
    flow:
      - get:
          url: "/flashcards"
          expect:
            - statusCode: 200

  - name: "Get flashcards by SRS level"
    weight: 15
    flow:
      - get:
          url: "/flashcards?level={{ srs_levels }}"
          expect:
            - statusCode: 200

  - name: "Get due reviews"
    weight: 15
    flow:
      - get:
          url: "/flashcards/due"
          expect:
            - statusCode: 200