tests/load/video-classrooms.load.yml
config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3000' }}"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN || 'test-token' }}"
  processor: "./helpers/video-classrooms-helpers.js"

scenarios:
  - name: "Start video call (create LiveKit room)"
    weight: 40
    flow:
      - post:
          url: "/video-calls/start"
          capture:
            - json: "$.roomName"
              as: "created_room_name"
            - json: "$.token"
              as: "created_token"
          expect:
            - statusCode: 201

  - name: "Accept video call (join existing room)"
    weight: 40
    flow:
      - post:
          url: "/video-calls/accept"
          json:
            roomName: "video_load_test_{{ $randomChoice('alpha', 'beta', 'gamma', 'delta', 'epsilon', 'zeta', 'iota', 'kappa', 'lambda', 'mu') }}"
          capture:
            - json: "$.token"
              as: "joined_token"
          expect:
            - statusCode: 200

  - name: "Start then accept call (full flow)"
    weight: 20
    flow:
      - post:
          url: "/video-calls/start"
          capture:
            - json: "$.roomName"
              as: "flow_room_name"
          expect:
            - statusCode: 201
      - post:
          url: "/video-calls/accept"
          json:
            roomName: "{{ flow_room_name }}"
          capture:
            - json: "$.token"
              as: "flow_joined_token"
          expect:
            - statusCode: 200